// Generated by jextract

package org.box2d;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$125 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$125() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorA"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorB"),
        JAVA_FLOAT.withName("length"),
        JAVA_BOOLEAN.withName("enableSpring"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("hertz"),
        JAVA_FLOAT.withName("dampingRatio"),
        JAVA_BOOLEAN.withName("enableLimit"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("minLength"),
        JAVA_FLOAT.withName("maxLength"),
        JAVA_BOOLEAN.withName("enableMotor"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("maxMotorForce"),
        JAVA_FLOAT.withName("motorSpeed"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(7),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2DistanceJointDef");
    static final VarHandle const$1 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("length"));
    static final VarHandle const$2 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("enableSpring"));
    static final VarHandle const$3 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("hertz"));
    static final VarHandle const$4 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("dampingRatio"));
    static final VarHandle const$5 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("enableLimit"));
}


