// Generated by jextract

package org.box2d;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$127 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$127() {}
    static final VarHandle const$0 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("userData"));
    static final VarHandle const$1 = constants$125.const$0.varHandle(MemoryLayout.PathElement.groupElement("internalValue"));
    static final FunctionDescriptor const$2 = FunctionDescriptor.of(MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorA"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorB"),
        JAVA_FLOAT.withName("length"),
        JAVA_BOOLEAN.withName("enableSpring"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("hertz"),
        JAVA_FLOAT.withName("dampingRatio"),
        JAVA_BOOLEAN.withName("enableLimit"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("minLength"),
        JAVA_FLOAT.withName("maxLength"),
        JAVA_BOOLEAN.withName("enableMotor"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("maxMotorForce"),
        JAVA_FLOAT.withName("motorSpeed"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(7),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2DistanceJointDef"));
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        "b2DefaultDistanceJointDef",
        constants$127.const$2
    );
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("linearOffset"),
        JAVA_FLOAT.withName("angularOffset"),
        JAVA_FLOAT.withName("maxForce"),
        JAVA_FLOAT.withName("maxTorque"),
        JAVA_FLOAT.withName("correctionFactor"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(7),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2MotorJointDef");
    static final VarHandle const$5 = constants$127.const$4.varHandle(MemoryLayout.PathElement.groupElement("angularOffset"));
}


