// Generated by jextract

package org.box2d;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$141 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$141() {}
    static final VarHandle const$0 = constants$139.const$2.varHandle(MemoryLayout.PathElement.groupElement("collideConnected"));
    static final VarHandle const$1 = constants$139.const$2.varHandle(MemoryLayout.PathElement.groupElement("userData"));
    static final VarHandle const$2 = constants$139.const$2.varHandle(MemoryLayout.PathElement.groupElement("internalValue"));
    static final FunctionDescriptor const$3 = FunctionDescriptor.of(MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorA"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAxisA"),
        JAVA_BOOLEAN.withName("enableSpring"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("hertz"),
        JAVA_FLOAT.withName("dampingRatio"),
        JAVA_BOOLEAN.withName("enableLimit"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("lowerTranslation"),
        JAVA_FLOAT.withName("upperTranslation"),
        JAVA_BOOLEAN.withName("enableMotor"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("maxMotorTorque"),
        JAVA_FLOAT.withName("motorSpeed"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(3),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2WheelJointDef"));
    static final MethodHandle const$4 = RuntimeHelper.downcallHandle(
        "b2DefaultWheelJointDef",
        constants$141.const$3
    );
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_LONG.withName("maskBits"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("position"),
        JAVA_FLOAT.withName("radius"),
        JAVA_FLOAT.withName("falloff"),
        JAVA_FLOAT.withName("impulsePerLength"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2ExplosionDef");
}


