// Generated by jextract

package org.box2d;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$134 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$134() {}
    static final VarHandle const$0 = constants$131.const$4.varHandle(MemoryLayout.PathElement.groupElement("internalValue"));
    static final FunctionDescriptor const$1 = FunctionDescriptor.of(MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorA"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAxisA"),
        JAVA_FLOAT.withName("referenceAngle"),
        JAVA_FLOAT.withName("targetTranslation"),
        JAVA_BOOLEAN.withName("enableSpring"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("hertz"),
        JAVA_FLOAT.withName("dampingRatio"),
        JAVA_BOOLEAN.withName("enableLimit"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("lowerTranslation"),
        JAVA_FLOAT.withName("upperTranslation"),
        JAVA_BOOLEAN.withName("enableMotor"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("maxMotorForce"),
        JAVA_FLOAT.withName("motorSpeed"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(3),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2PrismaticJointDef"));
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        "b2DefaultPrismaticJointDef",
        constants$134.const$1
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("index1"),
            JAVA_SHORT.withName("world0"),
            JAVA_SHORT.withName("generation")
        ).withName("bodyIdB"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorA"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("x"),
            JAVA_FLOAT.withName("y")
        ).withName("localAnchorB"),
        JAVA_FLOAT.withName("referenceAngle"),
        JAVA_FLOAT.withName("targetAngle"),
        JAVA_BOOLEAN.withName("enableSpring"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("hertz"),
        JAVA_FLOAT.withName("dampingRatio"),
        JAVA_BOOLEAN.withName("enableLimit"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("lowerAngle"),
        JAVA_FLOAT.withName("upperAngle"),
        JAVA_BOOLEAN.withName("enableMotor"),
        MemoryLayout.paddingLayout(3),
        JAVA_FLOAT.withName("maxMotorTorque"),
        JAVA_FLOAT.withName("motorSpeed"),
        JAVA_FLOAT.withName("drawSize"),
        JAVA_BOOLEAN.withName("collideConnected"),
        MemoryLayout.paddingLayout(7),
        RuntimeHelper.POINTER.withName("userData"),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2RevoluteJointDef");
    static final VarHandle const$4 = constants$134.const$3.varHandle(MemoryLayout.PathElement.groupElement("referenceAngle"));
    static final VarHandle const$5 = constants$134.const$3.varHandle(MemoryLayout.PathElement.groupElement("targetAngle"));
}


