// Generated by jextract

package org.box2d;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$117 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$117() {}
    static final VarHandle const$0 = constants$115.const$2.varHandle(MemoryLayout.PathElement.groupElement("internalValue"));
    static final FunctionDescriptor const$1 = FunctionDescriptor.of(MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("userData"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("friction"),
            JAVA_FLOAT.withName("restitution"),
            JAVA_FLOAT.withName("rollingResistance"),
            JAVA_FLOAT.withName("tangentSpeed"),
            JAVA_INT.withName("userMaterialId"),
            JAVA_INT.withName("customColor")
        ).withName("material"),
        JAVA_FLOAT.withName("density"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_LONG.withName("categoryBits"),
            JAVA_LONG.withName("maskBits"),
            JAVA_INT.withName("groupIndex"),
            MemoryLayout.paddingLayout(4)
        ).withName("filter"),
        JAVA_BOOLEAN.withName("isSensor"),
        JAVA_BOOLEAN.withName("enableSensorEvents"),
        JAVA_BOOLEAN.withName("enableContactEvents"),
        JAVA_BOOLEAN.withName("enableHitEvents"),
        JAVA_BOOLEAN.withName("enablePreSolveEvents"),
        JAVA_BOOLEAN.withName("invokeContactCreation"),
        JAVA_BOOLEAN.withName("updateBodyMass"),
        MemoryLayout.paddingLayout(1),
        JAVA_INT.withName("internalValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("b2ShapeDef"));
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        "b2DefaultShapeDef",
        constants$117.const$1
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("userData"),
        RuntimeHelper.POINTER.withName("points"),
        JAVA_INT.withName("count"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("materials"),
        JAVA_INT.withName("materialCount"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_LONG.withName("categoryBits"),
            JAVA_LONG.withName("maskBits"),
            JAVA_INT.withName("groupIndex"),
            MemoryLayout.paddingLayout(4)
        ).withName("filter"),
        JAVA_BOOLEAN.withName("isLoop"),
        JAVA_BOOLEAN.withName("enableSensorEvents"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("internalValue")
    ).withName("b2ChainDef");
    static final VarHandle const$4 = constants$117.const$3.varHandle(MemoryLayout.PathElement.groupElement("userData"));
    static final VarHandle const$5 = constants$117.const$3.varHandle(MemoryLayout.PathElement.groupElement("points"));
}


